wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/lptmr_reg.h
#define LPTMR_CTL_PSC_Pos               (0)                                         /*!< LPTMR_T::CTL: PSC Position                 */
#define LPTMR_CTL_PSC_Msk               (0xffUL << LPTMR_CTL_PSC_Pos)               /*!< LPTMR_T::CTL: PSC Mask                     */

#define LPTMR_CTL_FUNCSEL_Pos           (15)                                        /*!< LPTMR_T::CTL: FUNCSEL Position             */
#define LPTMR_CTL_FUNCSEL_Msk           (0x1UL << LPTMR_CTL_FUNCSEL_Pos)            /*!< LPTMR_T::CTL: FUNCSEL Mask                 */

#define LPTMR_CTL_PDCLKEN_Pos           (16)                                        /*!< LPTMR_T::CTL: PDCLKEN Position             */
#define LPTMR_CTL_PDCLKEN_Msk           (0x1UL << LPTMR_CTL_PDCLKEN_Pos)            /*!< LPTMR_T::CTL: PDCLKEN Mask                 */

#define LPTMR_CTL_PERIOSEL_Pos          (20)                                        /*!< LPTMR_T::CTL: PERIOSEL Position            */
#define LPTMR_CTL_PERIOSEL_Msk          (0x1UL << LPTMR_CTL_PERIOSEL_Pos)           /*!< LPTMR_T::CTL: PERIOSEL Mask                */

#define LPTMR_CTL_TGLPINSEL_Pos         (21)                                        /*!< LPTMR_T::CTL: TGLPINSEL Position           */
#define LPTMR_CTL_TGLPINSEL_Msk         (0x1UL << LPTMR_CTL_TGLPINSEL_Pos)          /*!< LPTMR_T::CTL: TGLPINSEL Mask               */

#define LPTMR_CTL_CAPSRC_Pos            (22)                                        /*!< LPTMR_T::CTL: CAPSRC Position              */
#define LPTMR_CTL_CAPSRC_Msk            (0x1UL << LPTMR_CTL_CAPSRC_Pos)             /*!< LPTMR_T::CTL: CAPSRC Mask                  */

#define LPTMR_CTL_WKEN_Pos              (23)                                        /*!< LPTMR_T::CTL: WKEN Position                */
#define LPTMR_CTL_WKEN_Msk              (0x1UL << LPTMR_CTL_WKEN_Pos)               /*!< LPTMR_T::CTL: WKEN Mask                    */

#define LPTMR_CTL_EXTCNTEN_Pos          (24)                                        /*!< LPTMR_T::CTL: EXTCNTEN Position            */
#define LPTMR_CTL_EXTCNTEN_Msk          (0x1UL << LPTMR_CTL_EXTCNTEN_Pos)           /*!< LPTMR_T::CTL: EXTCNTEN Mask                */

#define LPTMR_CTL_ACTSTS_Pos            (25)                                        /*!< LPTMR_T::CTL: ACTSTS Position              */
#define LPTMR_CTL_ACTSTS_Msk            (0x1UL << LPTMR_CTL_ACTSTS_Pos)             /*!< LPTMR_T::CTL: ACTSTS Mask                  */

#define LPTMR_CTL_OPMODE_Pos            (27)                                        /*!< LPTMR_T::CTL: OPMODE Position              */
#define LPTMR_CTL_OPMODE_Msk            (0x3UL << LPTMR_CTL_OPMODE_Pos)             /*!< LPTMR_T::CTL: OPMODE Mask                  */

#define LPTMR_CTL_INTEN_Pos             (29)                                        /*!< LPTMR_T::CTL: INTEN Position               */
#define LPTMR_CTL_INTEN_Msk             (0x1UL << LPTMR_CTL_INTEN_Pos)              /*!< LPTMR_T::CTL: INTEN Mask                   */

#define LPTMR_CTL_CNTEN_Pos             (30)                                        /*!< LPTMR_T::CTL: CNTEN Position               */
#define LPTMR_CTL_CNTEN_Msk             (0x1UL << LPTMR_CTL_CNTEN_Pos)              /*!< LPTMR_T::CTL: CNTEN Mask                   */

#define LPTMR_CTL_ICEDEBUG_Pos          (31)                                        /*!< LPTMR_T::CTL: ICEDEBUG Position            */
#define LPTMR_CTL_ICEDEBUG_Msk          (0x1UL << LPTMR_CTL_ICEDEBUG_Pos)           /*!< LPTMR_T::CTL: ICEDEBUG Mask                */

#define LPTMR_CMP_CMPDAT_Pos            (0)                                         /*!< LPTMR_T::CMP: CMPDAT Position              */
#define LPTMR_CMP_CMPDAT_Msk            (0xffffffUL << LPTMR_CMP_CMPDAT_Pos)        /*!< LPTMR_T::CMP: CMPDAT Mask                  */

#define LPTMR_INTSTS_TIF_Pos            (0)                                         /*!< LPTMR_T::INTSTS: TIF Position              */
#define LPTMR_INTSTS_TIF_Msk            (0x1UL << LPTMR_INTSTS_TIF_Pos)             /*!< LPTMR_T::INTSTS: TIF Mask                  */

#define LPTMR_INTSTS_TWKF_Pos           (1)                                         /*!< LPTMR_T::INTSTS: TWKF Position             */
#define LPTMR_INTSTS_TWKF_Msk           (0x1UL << LPTMR_INTSTS_TWKF_Pos)            /*!< LPTMR_T::INTSTS: TWKF Mask                 */

#define LPTMR_CNT_CNT_Pos               (0)                                         /*!< LPTMR_T::CNT: CNT Position                 */
#define LPTMR_CNT_CNT_Msk               (0xffffffUL << LPTMR_CNT_CNT_Pos)           /*!< LPTMR_T::CNT: CNT Mask                     */

#define LPTMR_CNT_RSTACT_Pos            (31)                                        /*!< LPTMR_T::CNT: RSTACT Position              */
#define LPTMR_CNT_RSTACT_Msk            (0x1UL << LPTMR_CNT_RSTACT_Pos)             /*!< LPTMR_T::CNT: RSTACT Mask                  */

#define LPTMR_CAP_CAPDAT_Pos            (0)                                         /*!< LPTMR_T::CAP: CAPDAT Position              */
#define LPTMR_CAP_CAPDAT_Msk            (0xffffffUL << LPTMR_CAP_CAPDAT_Pos)        /*!< LPTMR_T::CAP: CAPDAT Mask                  */

#define LPTMR_EXTCTL_CNTPHASE_Pos       (0)                                         /*!< LPTMR_T::EXTCTL: CNTPHASE Position         */
#define LPTMR_EXTCTL_CNTPHASE_Msk       (0x1UL << LPTMR_EXTCTL_CNTPHASE_Pos)        /*!< LPTMR_T::EXTCTL: CNTPHASE Mask             */

#define LPTMR_EXTCTL_CAPEN_Pos          (3)                                         /*!< LPTMR_T::EXTCTL: CAPEN Position            */
#define LPTMR_EXTCTL_CAPEN_Msk          (0x1UL << LPTMR_EXTCTL_CAPEN_Pos)           /*!< LPTMR_T::EXTCTL: CAPEN Mask                */

#define LPTMR_EXTCTL_CAPFUNCS_Pos       (4)                                         /*!< LPTMR_T::EXTCTL: CAPFUNCS Position         */
#define LPTMR_EXTCTL_CAPFUNCS_Msk       (0x1UL << LPTMR_EXTCTL_CAPFUNCS_Pos)        /*!< LPTMR_T::EXTCTL: CAPFUNCS Mask             */

#define LPTMR_EXTCTL_CAPIEN_Pos         (5)                                         /*!< LPTMR_T::EXTCTL: CAPIEN Position           */
#define LPTMR_EXTCTL_CAPIEN_Msk         (0x1UL << LPTMR_EXTCTL_CAPIEN_Pos)          /*!< LPTMR_T::EXTCTL: CAPIEN Mask               */

#define LPTMR_EXTCTL_CAPDBEN_Pos        (6)                                         /*!< LPTMR_T::EXTCTL: CAPDBEN Position          */
#define LPTMR_EXTCTL_CAPDBEN_Msk        (0x1UL << LPTMR_EXTCTL_CAPDBEN_Pos)         /*!< LPTMR_T::EXTCTL: CAPDBEN Mask              */

#define LPTMR_EXTCTL_CNTDBEN_Pos        (7)                                         /*!< LPTMR_T::EXTCTL: CNTDBEN Position          */
#define LPTMR_EXTCTL_CNTDBEN_Msk        (0x1UL << LPTMR_EXTCTL_CNTDBEN_Pos)         /*!< LPTMR_T::EXTCTL: CNTDBEN Mask              */

#define LPTMR_EXTCTL_INTERCAPSEL_Pos    (8)                                         /*!< LPTMR_T::EXTCTL: INTERCAPSEL Position      */
#define LPTMR_EXTCTL_INTERCAPSEL_Msk    (0xfUL << LPTMR_EXTCTL_INTERCAPSEL_Pos)     /*!< LPTMR_T::EXTCTL: INTERCAPSEL Mask          */

#define LPTMR_EXTCTL_CAPEDGE_Pos        (12)                                        /*!< LPTMR_T::EXTCTL: CAPEDGE Position          */
#define LPTMR_EXTCTL_CAPEDGE_Msk        (0x7UL << LPTMR_EXTCTL_CAPEDGE_Pos)         /*!< LPTMR_T::EXTCTL: CAPEDGE Mask              */

#define LPTMR_EXTCTL_ECNTSSEL_Pos       (16)                                        /*!< LPTMR_T::EXTCTL: ECNTSSEL Position         */
#define LPTMR_EXTCTL_ECNTSSEL_Msk       (0x7UL << LPTMR_EXTCTL_ECNTSSEL_Pos)        /*!< LPTMR_T::EXTCTL: ECNTSSEL Mask             */

#define LPTMR_EXTCTL_CAPDIVSCL_Pos      (28)                                        /*!< LPTMR_T::EXTCTL: CAPDIVSCL Position        */
#define LPTMR_EXTCTL_CAPDIVSCL_Msk      (0xfUL << LPTMR_EXTCTL_CAPDIVSCL_Pos)       /*!< LPTMR_T::EXTCTL: CAPDIVSCL Mask            */

#define LPTMR_EINTSTS_CAPIF_Pos         (0)                                         /*!< LPTMR_T::EINTSTS: CAPIF Position           */
#define LPTMR_EINTSTS_CAPIF_Msk         (0x1UL << LPTMR_EINTSTS_CAPIF_Pos)          /*!< LPTMR_T::EINTSTS: CAPIF Mask               */

#define LPTMR_EINTSTS_CAPIFOV_Pos       (1)                                         /*!< LPTMR_T::EINTSTS: CAPIFOV Position         */
#define LPTMR_EINTSTS_CAPIFOV_Msk       (0x1UL << LPTMR_EINTSTS_CAPIFOV_Pos)        /*!< LPTMR_T::EINTSTS: CAPIFOV Mask             */

#define LPTMR_TRGCTL_TRGSSEL_Pos        (0)                                         /*!< LPTMR_T::TRGCTL: TRGSSEL Position          */
#define LPTMR_TRGCTL_TRGSSEL_Msk        (0x1UL << LPTMR_TRGCTL_TRGSSEL_Pos)         /*!< LPTMR_T::TRGCTL: TRGSSEL Mask              */

#define LPTMR_TRGCTL_TRGEN_Pos          (1)                                         /*!< LPTMR_T::TRGCTL: TRGEN Position            */
#define LPTMR_TRGCTL_TRGEN_Msk          (0x1UL << LPTMR_TRGCTL_TRGEN_Pos)           /*!< LPTMR_T::TRGCTL: TRGEN Mask                */

#define LPTMR_TRGCTL_TRGLPPDMA_Pos      (4)                                         /*!< LPTMR_T::TRGCTL: TRGLPPDMA Position        */
#define LPTMR_TRGCTL_TRGLPPDMA_Msk      (0x1UL << LPTMR_TRGCTL_TRGLPPDMA_Pos)       /*!< LPTMR_T::TRGCTL: TRGLPPDMA Mask            */

